Tekla Open API Reference for Tekla Structures 2025
Events Events
The Events type exposes the following members.
Events
Name | Description
DocumentManagerClosed
 The DocumentManagerClosed eventis raised when the document manager is closed.
DrawingEditorClosed
 The DrawingEditorClosed event is raised when the drawing editor is closed.
DrawingEditorOpened
 The DrawingEditorOpened event is raised when the drawing editor is opened.
DrawingListSelectionChanged
 The DrawingListSelectionChanged event is raised when selection on the drawing list has changed.
DrawingLoaded
 The DrawingLoaded event is raised when a new drawing is opened in the drawing editor.
Interrupted
 Occurs when user interrupts.
LayoutEditingModeEntered
 The LayoutEditingModeEntered event is raised when layout editing mode is started.
LayoutEditingModeExited
 The LayoutEditingModeEntered event is raised when layout editing mode is finished.
LayoutOptionModified
 The event is raised when layout option is modified
LayoutTableDeleted
 The event is raised when table is deleted
LayoutTableInserted
 The event is raised when table is inserted
LayoutTableLayoutModified
 The event is raised when tablelayout is modified
LayoutTableModified
 The event is never raised
SelectionChange
 The SelectionChange event is raised when the selection is changed in a Tekla Structures drawing.
Top
See Also
Reference
Events Class
Tekla.Structures.Drawing.UI Namespace